
&НаСервере
Процедура ЗаполнитьНаСервере()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// werwrwerwerДанный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Техника.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Техника КАК Техника";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Гсч = Новый ГенераторСлучайныхЧисел();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СпрОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		//СпрОбъект.КоординатыШирота = "63.2882537236" + Строка(Формат(ГСЧ.СлучайноеЧисло(1111,9999),"ЧГ="));
		//СпрОбъект.КоординатыДолгота = "118.4362525460" + Строка(Формат(ГСЧ.СлучайноеЧисло(1111,9999),"ЧГ="));
		СпрОбъект.ПоступилНаУчет = Дата(2020,1,1) + 24*3600*ГСЧ.СлучайноеЧисло(1,500); 
		СпрОбъект.СнятиеСУчета = Дата(2025,1,1) + 24*3600*ГСЧ.СлучайноеЧисло(1,700);
		СпрОбъект.Записать();
	КонецЦикла;
	
	Сообщить("Все заполнено!");	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
